RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "r/shittymusic"], ["description", "Share the shittiest music!"], ["user_id", 1], ["created_at", "2018-11-21 01:25:51.779325"], ["updated_at", "2018-11-21 01:25:51.779325"]]
---
  def create
    @sub = Sub.new(sub_params)

    if @sub.save